HRTCELL/Xiao-Halow-to-WiFi-Bridge/examples/iperf_esp32c6/sdkconfig.defaults
# Xiao ESP32-C6: native WiFi iperf (no HaLow)
CONFIG_IDF_TARGET="esp32c6"

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_LWIP_ETHARP_TRUST_IP_MAC=n
CONFIG_LWIP_IRAM_OPTIMIZATION=y
